feat: support mermaid codes render; advanced topic of pointer semantic (#28)
* fix as to the lightweight load mermiad

* fix quality check
